[
  {
    "name": "Sophia Vera",
    "avatar": "./assets/user1.png",
    "messages": [
      {
        "sender": {
          "name": "Sophia Vera",
          "avatar": "./assets/user2.png"
        },
        "recipient": {
          "name": "Anne Klen",
          "avatar": "./assets/user1.png"
        },
        "messages": [
          {
            "time": "11:30am",
            "message": "Alright let's get started then..."
          },
          {
            "time": "12:01pm",
            "message": "Can you explain the theory you. Can you explain the theory you.."
          }
        ]
      }
    ],
    "count": 2
  },
  {
    "name": "Anne Klen",
    "avatar": "./assets/user3.png",
    "messages": [
      {
        "sender": {
          "name": "Sophia Vera",
          "avatar": "./assets/user4.png"
        },
        "recipient": {
          "name": "Anne Klen",
          "avatar": "./assets/user3.png"
        },
        "messages": [
          {
            "time": "11:30am",
            "message": "Alright let's get started then..."
          },
          {
            "time": "12:01pm",
            "message": "Can you explain the theory you. Can you explain the theory you.."
          },
          {
            "time": "June 15",
            "message": "Sure! that would be really helpful..."
          },
          {
            "time": "June 16",
            "message": "I have been able to conclude that..."
          },
          {
            "time": "June 17",
            "message": "Let's schedule a meeting for next week."
          },
          {
            "time": "June 18",
            "message": "Sounds good. I'll check my calendar."
          }
        ]
      },
      {
        "sender": {
          "name": "Anne Klen",
          "avatar": "./assets/user5.png"
        },
        "recipient": {
          "name": "Sophia Vera",
          "avatar": "./assets/user1.png"
        },
        "messages": [
          {
            "time": "11:30am",
            "message": "Alright, let's start discussing it. This approach allows you to rotate an icon inside .message-options-button by 180 degrees when the button is hovered over, providing visual feedback to the user. Adjust the styles and specifics to match your project’s design and icon requirements."
          },
          {
            "time": "12:05pm",
            "message": "Sure! I'll explain the theory now. Your existing jQuery code is handling file management and interaction quite effectively. If you have any specific changes or enhancements you'd like to make, or if you have questions about how the code works, feel free to let me know!"
          }
        ]
      }
    ],
    "count": 2
  },
  {
    "name": "John Doe",
    "avatar": "./assets/user5.png",
    "messages": [
      {
        "sender": {
          "name": "John Doe",
          "avatar": "./assets/user3.png"
        },
        "recipient": {
          "name": "Vivian Lez",
          "avatar": "./assets/user5.png"
        },
        "messages": [
          {
            "time": "June 15",
            "message": "Sure! that would be really helpful... Your existing jQuery code is handling file management and interaction quite effectively. If you have any specific changes or enhancements you'd like to make, or if you have questions about how the code works, feel free to let me know!"
          },
          {
            "time": "June 16",
            "message": "I have been able to conclude that... Your existing jQuery code is handling file management and interaction quite effectively. If you have any specific changes or enhancements you'd like to make, or if you have questions about how the code works, feel free to let me know!"
          }
        ]
      }
    ],
    "count": 2
  },
  {
    "name": "Vivian Lez",
    "avatar": "./assets/user2.png",
    "messages": [
      {
        "sender": {
          "name": "John Doe",
          "avatar": "./assets/user4.png"
        },
        "recipient": {
          "name": "Vivian Lez",
          "avatar": "./assets/user2.png"
        },
        "messages": [
          {
            "time": "June 15",
            "message": "Sure! that would be really helpful..."
          },
          {
            "time": "June 16",
            "message": "I have been able to conclude that..."
          }
        ]
      }
    ],
    "count": 2
  },
  {
    "name": "Tami Lynn",
    "avatar": "./assets/user1.png",
    "messages": [
      {
        "sender": {
          "name": "Tami Lynn",
          "avatar": "./assets/user5.png"
        },
        "recipient": {
          "name": "John Lynn",
          "avatar": "./assets/user1.png"
        },
        "messages": [
          {
            "time": "June 15",
            "message": "That sounds awesome let's get..."
          },
          {
            "time": "June 16",
            "message": "Let's finalize the details today. Let's finalize the details today"
          }
        ]
      }
    ],
    "count": 2
  },
  {
    "name": "John Lynn",
    "avatar": "./assets/user4.png",
    "messages": [
      {
        "sender": {
          "name": "Tami Lynn",
          "avatar": "./assets/user3.png"
        },
        "recipient": {
          "name": "John Lynn",
          "avatar": "./assets/user4.png"
        },
        "messages": [
          {
            "time": "June 15",
            "message": "That sounds awesome let's get... Your existing jQuery code is handling file management and interaction quite effectively. If you have any specific changes or enhancements you'd like to make, or if you have questions about how the code works, feel free to let me know!"
          },
          {
            "time": "June 16",
            "message": "Let's finalize the details today. Your existing jQuery code is handling file management and interaction quite effectively. If you have any specific changes or enhancements you'd like to make, or if you have questions about how the code works, feel free to let me know!"
          },
          {
            "time": "June 17",
            "message": "Sure, I'll bring the documents. Amoung these challenges is a smart egg incubator that can withstand the load shedding being experienced. It is an honor for us to present to you a smart incubator that we've developed. This incubator uses IOT to monitor the condition of the eggs namely, temperature and humidity and has a GSM interface which communicates to the user via SMS and periodically sends information to the user. It is further equipped with an automatic motor that automatically turns the eggs after a specialized period of time. All this information is stored on a database."
          },
          {
            "time": "June 18",
            "message": "Great! Looking forward to it. Amoung these challenges is a smart egg incubator that can withstand the load shedding being experienced. It is an honor for us to present to you a smart incubator that we've developed. This incubator uses IOT to monitor the condition of the eggs namely, temperature and humidity and has a GSM interface which communicates to the user via SMS and periodically sends information to the user. It is further equipped with an automatic motor that automatically turns the eggs after a specialized period of time. All this information is stored on a database."
          }
        ]
      }
    ],
    "count": 2
  },
  {
    "name": "Kani Lynn",
    "avatar": "./assets/user3.png",
    "messages": [
      {
        "sender": {
          "name": "Kani Lynn",
          "avatar": "./assets/user5.png"
        },
        "recipient": {
          "name": "Loren Lynn",
          "avatar": "./assets/user3.png"
        },
        "messages": [
          {
            "time": "June 15",
            "message": "Are you available for a meeting? Amoung these challenges is a smart egg incubator that can withstand the load shedding being experienced. It is an honor for us to present to you a smart incubator that we've developed. This incubator uses IOT to monitor the condition of the eggs namely, temperature and humidity and has a GSM interface which communicates to the user via SMS and periodically sends information to the user. It is further equipped with an automatic motor that automatically turns the eggs after a specialized period of time. All this information is stored on a database."
          },
          {
            "time": "June 16",
            "message": "Yes, I am. Let's discuss the agenda. Amoung these challenges is a smart egg incubator that can withstand the load shedding being experienced. It is an honor for us to present to you a smart incubator that we've developed. This incubator uses IOT to monitor the condition of the eggs namely, temperature and humidity and has a GSM interface which communicates to the user via SMS and periodically sends information to the user. It is further equipped with an automatic motor that automatically turns the eggs after a specialized period of time. All this information is stored on a database."
          }
        ]
      }
    ],
    "count": 2
  },
  {
    "name": "Loren Lynn",
    "avatar": "./assets/user5.png",
    "messages": [
      {
        "sender": {
          "name": "Kani Lynn",
          "avatar": "./assets/user1.png"
        },
        "recipient": {
          "name": "Loren Lynn",
          "avatar": "./assets/user5.png"
        },
        "messages": [
          {
            "time": "June 15",
            "message": "Are you available for a meeting?"
          },
          {
            "time": "June 16",
            "message": "Yes, I am. Let's discuss the agenda."
          },
          {
            "time": "June 15",
            "message": "Sure! that would be really helpful..."
          },
          {
            "time": "June 16",
            "message": "I have been able to conclude that..."
          },
          {
            "time": "June 17",
            "message": "Let's schedule a meeting for next week."
          },
          {
            "time": "June 18",
            "message": "Sounds good. I'll check my calendar."
          }
        ]
      }
    ],
    "count": 2
  }
]
